lkolbly/cmsis-svd/data/Cypress/S6E2C4.svd
        <!-- REGISTER "IRQ111MON" -->
        <register>
          <name>IRQ111MON</name>
          <description>IRQ111 Batch Read Register</description>
          <addressOffset>0x3C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADCINT4" -->
            <field>
              <name>ADCINT4</name>
              <description>Range comparison result interrupt request of the A/D converter unit 2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT3" -->
            <field>
              <name>ADCINT3</name>
              <description>Conversion result comparison interrupt request of the A/D converter unit 2</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT2" -->
            <field>
              <name>ADCINT2</name>
              <description>FIFO overrun interrupt request of the A/D converter unit 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT1" -->
            <field>
              <name>ADCINT1</name>
              <description>Scan conversion interrupt request of the A/D converter unit 2</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT0" -->
            <field>
              <name>ADCINT0</name>
              <description>Priority conversion interrupt request of the A/D converter unit 2</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ112MON" -->
        <register>
          <name>IRQ112MON</name>
          <description>IRQ112 Batch Read Register</description>
          <addressOffset>0x3C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CANDINT" -->
            <field>
              <name>CANDINT</name>
              <description>Interrupt request of DSTC transfer end interrupt of CAN-FD</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PCRCDINT" -->
            <field>
              <name>PCRCDINT</name>
              <description>Interrupt request of DSTC transfer end interrupt of Programmable CRC</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QSPIDINT1" -->
            <field>
              <name>QSPIDINT1</name>
              <description>Interrupt request of DSTC transfer end interrupt of Quad SPI(transmission)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QSPIDINT0" -->
            <field>
              <name>QSPIDINT0</name>
              <description>Interrupt request of DSTC transfer end interrupt of Quad SPI(reception)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "I2SDINT1" -->
            <field>
              <name>I2SDINT1</name>
              <description>Interrupt request of DSTC transfer end interrupt of I2S(transmission)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "I2SDINT0" -->
            <field>
              <name>I2SDINT0</name>
              <description>Interrupt request of DSTC transfer end interrupt of I2S(reception)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ113MON" -->
        <register>
          <name>IRQ113MON</name>
          <description>IRQ113 Batch Read Register</description>
          <addressOffset>0x3C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCEC0INT" -->
            <field>
              <name>RCEC0INT</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT4" -->
            <field>
              <name>USB_DRQ_INT4</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT3" -->
            <field>
              <name>USB_DRQ_INT3</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT2" -->
            <field>
              <name>USB_DRQ_INT2</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT1" -->
            <field>
              <name>USB_DRQ_INT1</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT0" -->
            <field>
              <name>USB_DRQ_INT0</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ114MON" -->
        <register>
          <name>IRQ114MON</name>
          <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
          <addressOffset>0x3CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCEC1INT" -->
            <field>
              <name>RCEC1INT</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT5" -->
            <field>
              <name>USB_INT5</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT4" -->
            <field>
              <name>USB_INT4</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT3" -->
            <field>
              <name>USB_INT3</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT2" -->
            <field>
              <name>USB_INT2</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT1" -->
            <field>
              <name>USB_INT1</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT0" -->
            <field>
              <name>USB_INT0</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
