lkolbly/cmsis-svd/data/Cypress/S6E2C4.svd
        <!-- REGISTER "IPCR1" -->
        <register>
          <name>IPCR1</name>
          <description>I2S-PLL Control Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPLLEN" -->
            <field>
              <name>IPLLEN</name>
              <description>I2S-PLL oscillation enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPCR2" -->
        <register>
          <name>IPCR2</name>
          <description>I2S-PLL Control Register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPOWT" -->
            <field>
              <name>IPOWT</name>
              <description>I2S-PLL oscillation stabilization wait time setting bits</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPCR3" -->
        <register>
          <name>IPCR3</name>
          <description>I2S-PLL Control Register 3</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPLLK" -->
            <field>
              <name>IPLLK</name>
              <description>Frequency division ratio (K) setting bits of the I2S-PLL clock</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPCR4" -->
        <register>
          <name>IPCR4</name>
          <description>I2S-PLL Control Register 4</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPLLN" -->
            <field>
              <name>IPLLN</name>
              <description>Frequency division ratio (N) setting bits of the I2S-PLL clock</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IP_STR" -->
        <register>
          <name>IP_STR</name>
          <description>I2S-PLL Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPRDY" -->
            <field>
              <name>IPRDY</name>
              <description>I2S-PLL oscillation stabilization bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPINT_ENR" -->
        <register>
          <name>IPINT_ENR</name>
          <description>I2S-PLL Interrupt Factor Enable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPCSE" -->
            <field>
              <name>IPCSE</name>
              <description>I2S-PLL oscillation stabilization wait complete interrupt enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPINT_CLR" -->
        <register>
          <name>IPINT_CLR</name>
          <description>I2S-PLL Interrupt Factor Status Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPCSC" -->
            <field>
              <name>IPCSC</name>
              <description>I2S-PLL interrupt factor status bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPINT_STR" -->
        <register>
          <name>IPINT_STR</name>
          <description>I2S-PLL Interrupt Factor Clear Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPCSI" -->
            <field>
              <name>IPCSI</name>
              <description>I2S-PLL oscillation stabilization interrupt factor clear bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPCR5" -->
        <register>
          <name>IPCR5</name>
          <description>I2S-PLL Control Register 5</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPLLM" -->
            <field>
              <name>IPLLM</name>
              <description>Frequency division ratio (M) setting bits of the I2S-PLL clock</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
