lkolbly/cmsis-svd/data/Cypress/S6E2C4.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "I2S0" -->
    <peripheral>
      <name>I2S0</name>
      <description>I2S</description>
      <groupName>I2S0</groupName>
      <baseAddress>0x4006C000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "PRGCRC_I2S" -->
      <interrupt>
        <name>PRGCRC_I2S</name>
        <value>117</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "RXFDAT" -->
        <register>
          <name>RXFDAT</name>
          <description>Receive FIFO Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RXDATA" -->
            <field>
              <name>RXDATA</name>
              <description>Words received from the serial bus are written to the receive FIFO</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXFDAT" -->
        <register>
          <name>TXFDAT</name>
          <description>Transmit FIFO Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXDATA" -->
            <field>
              <name>TXDATA</name>
              <description>As long as the transmit FIFO is not full, the words to be transmitted can be written.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CNTREG" -->
        <register>
          <name>CNTREG</name>
          <description>Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKRT" -->
            <field>
              <name>CKRT</name>
              <description>When operating in master mode, this sets the clock division ratio for output.</description>
              <lsb>26</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVHD" -->
            <field>
              <name>OVHD</name>
              <description>Following the valid data of the frame, it can insert OVERHEAD bits to enable adjustment of the frame rate.</description>
              <lsb>16</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSKB" -->
            <field>
              <name>MSKB</name>
              <description>This sets the serial output data of the invalid transmit frames</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSMD" -->
            <field>
              <name>MSMD</name>
              <description>This sets master or slave mode.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SBFN" -->
            <field>
              <name>SBFN</name>
              <description>This specifies the subframe configuration (number of subframes) of the frame</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RHLL" -->
            <field>
              <name>RHLL</name>
              <description>This sets the FIFO word configuration to one or two words</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECKM" -->
            <field>
              <name>ECKM</name>
              <description>In master mode, this selects the base clock divider.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEXT" -->
            <field>
              <name>BEXT</name>
              <description>When the receive word length is smaller than the FIFO word length, this sets the upper bit extension mode.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRUN" -->
            <field>
              <name>FRUN</name>
              <description>This sets the output mode of the frame sync signal</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MLSB" -->
            <field>
              <name>MLSB</name>
              <description>This sets word bit shift order</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXDIS" -->
            <field>
              <name>TXDIS</name>
              <description>This enables or disables the transmit function</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXDIS" -->
            <field>
              <name>RXDIS</name>
              <description>This enables or disables the receive function</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SMPL" -->
            <field>
              <name>SMPL</name>
              <description>This specifies the point where data is sampled</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CPOL" -->
            <field>
              <name>CPOL</name>
              <description>This specifies the I2SCK polarity where drive sampling of the serial data is performed</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSPH" -->
            <field>
              <name>FSPH</name>
              <description>This specifies the phase for I2SWS frame data</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSLN" -->
            <field>
              <name>FSLN</name>
              <description>This specifies the pulse width of I2SWS</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSPL" -->
            <field>
              <name>FSPL</name>
              <description>This sets the polarity of the I2SWS pin</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCR0REG" -->
        <register>
          <name>MCR0REG</name>
          <description>Channel Control Register 0</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFF7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "S1CHN" -->
            <field>
              <name>S1CHN</name>
              <description>This sets the number of channels for subframe 1</description>
              <lsb>26</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CHL" -->
            <field>
              <name>S1CHL</name>
              <description>This sets the channel length of the channels that make up subframe 1</description>
              <lsb>21</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1WDL" -->
            <field>
              <name>S1WDL</name>
              <description>This sets the word length of the channels that make up subframe 1</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CHN" -->
            <field>
              <name>S0CHN</name>
              <description>This sets the number of channels for subframe 0</description>
              <lsb>10</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CHL" -->
            <field>
              <name>S0CHL</name>
              <description>This sets the channel length of the channels that make up subframe 1</description>
              <lsb>5</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0WDL" -->
            <field>
              <name>S0WDL</name>
              <description>This sets the word length of the channels that make up subframe 1</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
